<template>
    <div class="page">
        <nav-header title="首页" :showLeft="false" :showRight="false"></nav-header>
        <Container>
            <div class="container">
                <div class="text-operation flex flex-v">
                    <input class="input" placeholder="请输入替换文本" v-model="findinput"/>
                    <input class="input" placeholder="请输入替换后的文本" v-model="replaceinput"/>
                    <div class="flex flex-hcenter">
                        <button class="button" @click="back">回退</button>
                        <button class="button" @click="replace">替换</button>    
                    </div>
                    
                </div>
                <div class="textarea" contentEditable="true" v-html="wordtext"></div>
            </div>
            
        </Container>
    </div>
</template>

<script type="text/javascript">
    import NavHeader from '../../components/nav-header';
    import Container from '../../components/container';
    export default {
        name: 'home-index', //组件名称
        //组件声明
        components:{
            NavHeader,
            Container,
        },
        //数据
        data(){
            return{
                findinput: '', //正则文本
                replaceinput: '', //替换后的文本
                wordtext: '\n\n\n\n\n施工负责人培训习题册\n（非动车）\n\n\n\n\n\n\n2018年7月\n\n目录\n第一部分 行车及基础类知识部分  3\n一、上海地铁气体灭火保护区域范围作业管理办法   3\n二、城市轨道交通保护区法律汇编  4\n三、上海轨道交通接触网[轨]接地线管理规定    5\n四、上海轨道交通动火作业管控规定 7\n第二部分 重点知识部分  8\n五、上海轨道交通检修施工管理规定（总则部分）   8\n六、上海轨道交通检修施工管理规定（考核部分）   10\n七、上海轨道交通检修施工管理规定（正线轨行区部分）   12\n八、上海轨道交通检修施工管理规定（车场部分）  17\n九、上海轨道交通检修施工管理规定（车站部分）  20\n十、轨道交通安全保护区巡查管理办法[试行]   22\n十一、上海轨道交通检修施工作业负责人管理规定  23\n十二、上海轨道交通施工管理系统使用管理规定   25\n十三、上海轨道交通接触轨线路轨行区作业安全管理规定   26\n \n\n第一部分 行车及基础类知识部分\n一、上海地铁气体灭火保护区域范围作业管理办法\n判断题\n1. 作业人员进入气体灭火保护区域，必须到车站变电值班室办理作业登记手续后方可进行作业。（×）\n2. 车站值班员或消防值班室值班员在接受气体灭火保护区域作业登记后，向OCC运营调度提出就地控制器“手/自动”状态转换至“手动”位的申请并告知具体作业范围及时段等情况，调度员根据具体情况并发布相应命令。（×）\n3. 如就地控制器手/自动状态切换开关故障或切换后指示灯未正确指示，车站或施工现场值班员无需立即处置和协调。（×）\n4. 作业过程中如发生火情，作业人员及值班人员应立即采取紧急喷放措施，启动气体喷放。（×）\n5. 作业过程中如遇防火系统报警，应立即检查作业区域范围内是否有火情并撤离气体灭火的保护区域范围。（√）\n单选题\n1. 车站值班员或消防值班室值班员在接受气体灭火保护区域作业登记后，向（C）提出就地控制器“手/自动”状态转换至“手动”位的申请并告知具体作业范围及时段等情况，调度员根据具体情况并发布相应命令。\n（A）OCC业务主管（B）OCC值班调度长（C）OCC设备调度（D）OCC运营调度 \n2. 得到车站或施工现场值班员传达的调度员许可命令后，作业人员进入气灭保护区域前应按“手/自动”状态切换操作步骤，将作业区域相关的气体保护区域的就地控制盘手/自动转换开关设置成（A）。\n（A）手动状态（B）自动状态（C）隔离状态（D）备用状态 \n3. 若气体灭火保护区域手动状态达（B）小时及以上或施工作业有阶段性、延续性或重大改造施工，消防系统的主管单位应上报集团相关职能部门进行审批备案。\n     （A）6（B）8（C）9（D）10\n\n\n\n二、城市轨道交通保护区法律汇编\n判断题\n1. 地下车站与隧道周边外侧六十米内设置控制保护区。（×）\n2. 在轨道交通安全保护区外进行建设工程施工，其工程施工机械可能跨越或者触及轨道交通地面车站、高架车站及其线路轨道的，施工单位应当采取必要的安全防护措施，不得影响轨道交通运营安全。（√）\n3. 轨道交通项目建设单位或者线路运营单位应当在十个工作日内作出技术审查意见，工程较大的项目，可分项进行技术审查，并将作出的技术审查意见报市运输管理处。（×）\n4. 作业项目建设单位在项目开工前，应当与轨道交通项目建设单位或者线路运营单位办妥在轨道交通安全保护区内作业的监护手续，并根据批准的作业方案进行施工。（√）\n5. 地面和高架车站以及线路轨道外边线外侧三十米内设置控制保护区。（√）\n\n单选题\n1. 地面和高架车站以及线路轨道外边线外侧（C）内设置控制保护区。\n   （A）十米（B）二十米（C）三十米（D）五十米\n2. 地下车站与隧道周边外侧（D）内设置控制保护区。\n（A）十米（B）二十米（C）三十米（D）五十米\n3. 出入口、通风亭、变电站等建筑物、构筑物外边线外侧（A）内设置控制保护区。\n（A）十米（B）二十米（C）三十米（D）五十米\n\n\n\n三、上海轨道交通接触网[轨]接地线管理规定\n判断题\n1. 对于车场内涉及车辆检修库[线]的停电类施工作业，施工负责人[施工主体单位]在DCC或驻勤点办理登记或注销时，应口头告知DCC设备值班员接地线的编号和数量，由DCC设备值班员将每根接地线的编号录入施工管理系统。（√）\n2. 工程车动车作业，行进路径中的部分区段已申请接触网[轨]停电防护。此类施工不必验电及挂设接地线。（√）\n3. 验电、接地是保证接触轨停电类施工作业重要的安全技术措施。在每一次作业前，应严格执行验电、接地操作规定。在工作完成后，应拆除接地线，先拆线夹端，再拆轨夹端。（×）\n4. 在接触轨线路上涉及的特殊“走行”类作业[如巡道施工、巡视轨行区等]。此类施工作业，在人员走行、巡道过程中可不挂设接触轨接地线，遇中途需进行检修施工且与接触轨安全距离低于700mm时，应按要求挂设接地线后再进行后续作业。（√）\n5. 在接触轨轨行区内的所有施工作业，作业人员[包括所持的机具，材料零部件等]与接触轨周围带电设备的安全距离低于700mm时，应挂设接地线后方可施工。（√）\n6. 施工主体管理单位由集团内部单位担任，负责对委外单位使用的接地线制定管理要求，并派专人对现场进行监管。（√）\n7. 挂设接触网[轨]接地线前，应先对挂设范围内接触网[轨]进行验电。（√）\n8. 挂设的接触网[轨]接地线可以在施工现场人员的可视范围以外。（×）\n9. 在同一个供电区段内的施工作业，对于双边供电的，应在施工作业面的两端同时挂设；对于单边供电的，应在施工作业面来电方向端挂设。挂设范围的不得超过该供电区段。（√）\n10. 验电后应挂设接触网[轨]接地线，因事延误或超过3 min以上未能挂设接触网[轨]接地线时，在挂设接触网[轨]接地线之前应重新验电。（×）\n11. 对于正线接触网[轨]停电类单点型施工作业，施工负责人[施工主体单位]在办理施工登记或注销时，应将接地线带至车控室[运营公司/磁浮公司]，由相应施工登记/注销站车控室值班员确认接地线的编号及数量，并将每根接地线的编号录入施工管理系统。（√）\n12. 同一供电区段内的所有需挂设接地线的停电类施工作业可共享接地线。（×）\n13. 挂设接触网[轨]接地线前，应先对挂设范围内接触网[轨]进行验电。（√）\n     \n单选题\n1. （D）负责对接触网[轨]停电施工作业中允许降级防护的施工进行安全风险评估，并发布允许通知。\n    （A）施工主体单位（B）运营管理部（C）运管中心（D）运营设施设备管理部\n2. （C）负责各线路[不含10号线]正线轨行区域、车场区域中涉及的站场、试车线、牵出线、出入场线范围内接触网[轨]的停、送电管理。\n    （A）施工主体单位（B）维保公司供电分公司（C）运管中心（D）运营公司\n3. （B）依据电力监控复视终端系统对停电区段[不含10号线]的设备状态进行监管，落实应急预案。\n    （A）施工主体单位（B）维保公司供电分公司（C）运管中心（D）运营公司\n4. （A）负责各线路[不含10号线]车场区域中涉及检修库[线]等[车辆检修用库房内]范围内，各股道[以绝缘分段为界]接触网[轨]停电类施工作业的停、送电管理，包括停电类施工作业申请单的审核、批复。\n    （A）维保公司车辆分公司（B）维保公司供电分公司（C）维保公司物资和后勤分公司（D）运营公司\n5. 对于正线接触网[轨]停电类多点型施工作业，（A）车控室值班员负责将所有接地线[含作业点]的编号录入施工管理系统。\n    （A）主登记站（B）入轨站（C）出轨站（D）作业点\n6. 对于车场内涉及车辆检修库[线]的停电类施工作业，施工负责人在DCC或驻勤点办理登记或注销时，应口头告知（C）接地线的编号和数量，由其将每根接地线的编号录入施工管理系统。\n    （A）DCC运转值班员（B）信号楼值班员（C）DCC设备值班员（D）车场主管\n7. 在接触轨线路上涉及的特殊“走行”类作业[如巡道施工、巡视轨行区等]。此类施工作业，在人员走行、巡道过程中可不挂设接触轨接地线，遇中途需进行检修施工且与接触轨安全距离低于（B）mm时，应按要求挂设接地线后再进行后续作业。\n    （A）600（B）700（C）800（D）900\n8. 验电后应挂设接触网[轨]接地线，因事延误或超过（D）min以上未能挂设接触网[轨]接地线时，在挂设接触网[轨]接地线之前应重新验电\n    （A）10（B）8（C）6（D）5\n9. 拆除接触网[轨]接地线时，应先拆除接触线[或汇流排、接地环、接触轨]上紧固的（B），再拆除回流钢轨上紧固的（B）。\n    （A）轨夹端、线夹端（B）线夹端、轨夹端（C）线夹端、线夹端（D）轨夹端、轨夹端\n10. 直流1500V接触网[轨]安全距离要求：在进行接触网[轨]停电类施工作业时，施工作业人员[包括所携带的工器具、材料零部件等]与周围带电设备[直流1500V]的距离不得小于（A）mm。\n    （A）700（B）600（C）500（D）400\n11. 在同一个供电区段内的施工作业，对于双边供电的，应在施工作业面的（D）同时挂设接地线。\n    （A）来电方向端（B）左端（C）右端（D）两端\n12. 在同一个供电区段内的施工作业，对于单边供电的，应在施工作业面（A）挂设接地线。\n    （A）来电方向端（B）左端（C）右端（D）两端\n\n\n\n四、上海轨道交通动火作业管控规定\n判断题\n1. 动火单位应在实施动火前1天将批准的动火作业审核意见书抄送管辖单位备案。（×）\n2. 动火作业实施前，管控单位应当组织安全风险评估，经评估符合动火条件的，方可批准动火作业申请。（√）\n3. 动火作业单位应当按照分级管控原则申报动火作业方案，经批准后由指定负责人带班，由安全管理人员进行现场安全检查和监护，并由具有专业资质的人员实施动火作业。（√）\n4. 管控单位应在收到动火申请之日起1天内组织审核，将作业现场安全风险评估、作业人员上岗资格、安全措施落实等作为前置条件。（×）\n5. 动火作业实施前，监护员应当组织安全教育交底，对作业现场危险源清除、作业人员持证在位、灭火器材配置以及安全防范措施落实等情况进行确认，凡不具备条件的，监护员有权停止本次动火作业计划。（√）\n6. 动火作业单位可安排无特种作业操作资格证书的人员从事动火作业。（×）\n\n单选题\n1. 动火单位应在实施动火前（B）日将批准的动火作业审核意见书抄送管辖单位备案。\n   （A）1（B）2（C）3（D）4\n2. （D）是动火作业及管控工作的责任主体单位。\n   （A）运管中心（B）安监室（C）集团公司保卫部（D）运营单位[含维保各专业公司]\n   （A）1（B）2（C）3（D）4\n3. 动火作业过程中，（A）应仔细观察动火作业的变化过程，一旦发生险情，应当及时处置。\n   （A）监护员（B）作业人员（C）车站值班员（D）站务员\n4. 紧急情况下因抢修所需的动火作业，按线路控制中心发布的抢修令执行，动火审批和现场安全管理由（B）负责。\n   （A）车站（B）抢修单位（C）线路控制中心（D）专业公司调度\n\n\n\n第二部分 重点知识部分\n五、上海轨道交通检修施工管理规定（总则部分）\n判断题：\n1. 在车站的端头门/屏蔽门/安全门以外的区域也属于车站施工范围。（×）\n2. 《上海轨道交通检修施工管理规定》适用于上海申通地铁集团有限公司所有运营[不包含试运营]的线路的施工管理工作，磁悬浮线路除外。（×）\n3. 800兆无线系统及调度电话属于行车设备。（√）\n4. AFC系统属于行车辅助设备。（×）\n5. 造成关键运营设施设备功能发生变化或缺失、行车或客运安全/服务受到影响、运行效率降低、运营模式发生重大变化的施工是重大施工。（√）\n6. 接触轨区域管控区是指在接触轨区域内，距离接触轨防护罩外缘小于或等于700 mm范围的区域，同时包括接触轨上方的空间范围。（√）\n7. 审批重大施工的运营配套方案是运营设施设备管理部的管理职责。（×）\n8. 运营管理部负责牵头开展集团施工考核工作。（√）\n9. 在车场区域内进行的不影响正线行车及列车出入车场的施工也需要申报正线轨行区计划。（×）\n10. 计划申报单位申报可以直接申报施工计划，非计划申报单位也可以直接申报计划。（×）\n11. 多专业联合实施的施工，由运营管理部明确的主体申报单位进行计划申报。（×）\n12. 计划申报单位应制定包含施工总体计划、施工现场实施方案、施工对运营的影响、应急预案、配合要求、保驾方案等内容的施工组织方案。（√）\n13. 须其他单位配合的施工，计划申报单位在计划申报时无需流转相关的单位。（×）\n14. 待计划审批后，计划审批单位再确认审批材料完整、齐全。（×）\n15. 计划审批单位确认施工组织方案合理、流程齐全，且流转的单位同意配合后，方可审批施工计划。（√）\n16. 特种作业施工人员应持有效证件上岗。（√）\n17. 施工人员无需接受施工区域管理单位工作人员的监督管理。（×）\n18. 施工负责人应按检修施工作业负责人管理规定要求，组织施工人员实施施工。（√）\n19. 施工登记手续完成后，施工负责人应落实施工安全防护措施。（√）\n20. 施工实施时，施工作业人员严格执行安全作业制度及操作规程，严禁动用不相关的运营设备。（√）\n21. 施工结束前，施工负责人应确认工完场清，施工内容涉及动用运营设备的，无需通知使用单位确认设备。（×）\n22. 重大施工分为：一级重大施工、二级重大施工、三级重大施工三类。（×）\n23. 在车站区域、车场区域、保护区内进行的影响或可能影响正线行车及列车出入车场的施工属于正线轨行区类施工。（√）\n24. 施工应按照“谁申报、谁负责”的原则，开展施工实施管理。（√）\n\n单选题\n1. 接触轨区域管控区是指在接触轨区域内，距离接触轨防护罩外缘小于或等于（C）mm范围的区域，同时包括接触轨上方的空间范围。\n（A）500（B）600（C）700（D）800\n2. 施工负责人的日常培训工作是（C）的管理职责。\n（A）运营管理部（B）运营设施设备管理部（C）计划申报单位（D）计划审批单位\n3. 根据施工地点和影响不同分为正线轨行区类施工、车站类施工、车场类施工、（A）施工。\n（A）保护区类（B）变电站类（C）触网停电类（D）动车类\n4. 多专业联合实施的施工，由（B）明确的主体申报单位进行计划申报。\n（A）运营管理部（B）运营设施设备管理部（C）计划申报单位（D）计划审批单位\n5. 施工负责人应按（C）要求，组织施工人员实施施工。\n（A）检修施工作业考核规定（B）车场检修施工作业管理规定（C）检修施工作业负责人管理规定（D）车站检修施工管理规定\n6. 施工结束前，施工负责人应确认工完场清，施工内容涉及动用运营设备的，应通知（A）确认设备正常。\n    （A）使用单位（B）OCC（C）运营公司调度（D）专业公司调度\n7. （D）应定期对各单位施工管理工作进行检查及考核。\n（A）计划申报单位（B）计划审批单位（C）施工管理领导小组（D）施工管理工作小组\n8. （A）负责代为申报施工的安全管理，落实施工安全风险抵押金制度。\n（A）计划申报单位（B）计划审批单位（C）施工管理领导小组（D）施工管理工作小组\n\n\n\n六、上海轨道交通检修施工管理规定（考核部分）\n判断题\n1. 运营管理部[运管中心]管理职责不包含负责组织施工考核会议。（×）\n2. 设施设备管理部[维保中心]管理职责不包含对违规单位提出考核意见。（√）\n3. 运营公司的管理职责不包含落实施工违规审核及整改。（×）\n4. 施工计划申报单位的管理职责不包含负责制定检修施工考核细则。（×）\n5. 施工作业考核范围包含保护区类施工。（√）\n6. 正线轨行区类施工考核指标项目不包含施工计划变更率。（×）\n7. 车场类施工考核指标项包含施工计划工时利用率。（×）\n8. 施工违规指标是统计各单位在统计周期内存在违反施工相关管理规定的施工件数。（√）\n9. 委外单位发生施工违规情况，需考核施工计划申报单位。（√）\n10. 专项施工提前完成，注明为“预留点”的施工取消，不计入统计指标。（√）\n11. 因极端天气等客观原因，导致无法实施的施工，经施工管理工作小组认定后，不计入统计指标。（√）\n12. 因抢修导致原施工取消或变更，计入统计指标。（×）\n13. 施工取消情况下，该施工计划总工时仍计入统计指标，实际总工时计为0 min。（√）\n14. 整体委外单位、项目公司只统计指标，不列入考核奖励范围。（√）\n15. 各单位应制定施工检修作业考核细则，对违规施工责任部门、个人进行相应的考核。（√）\n16. 因配合单位未能到位等原因，导致施工计划申报单位非主观因素造成的施工取消，不计入统计指标。（√）\n\n单选题\n1. 按月度考核标准，正线轨行区施工工时利用率低于（B）的该项指标不得分。\n（A）70%（B）85%（C）90%（D）95%\n2. 按月度考核标准，车场施工兑现率低于（A）的该项指标不得分。\n（A）92%（B）95%（C）97%（D）99%\n3. 按月度考核标准，发生一起严重违规施工事件扣（C）分。\n（A）10（B）30（C）60（D）80\n4. 车场类施工考核指标项目不含（D）。\n   （A）施工计划兑现率 （B）施工计划变更率（C）施工违规（D）施工计划工时利用率\n5. 维保公司按（B）独立专业分别进行考核评分和兑现。\n   （A）车辆、供电、通号  （B）车辆、供电、通号、工务\n   （C）供电、通号、工务  （D）车辆、供电、\n6. 在施工各环节中，发生造成运营列车最大晚点（D）min以上或首末班车最大晚点2 min以上的属于严重违规。\n（A）5（B）8（C）10（D）15\n7. 在施工各环节中，发生未按要求进行施工配合，造成施工延误（B）min以上的属于一般违规。\n（A）10（B）15（C）20（D）30\n8. 擅自动用与施工作业无关的设施设备的属于（D）违规。\n（A）特大（B）重大（C）严重（D）一般\n\n多选题\n1. 施工违规考核流程如下（ABCDE）。\n    （A）发生施工违规情况后，由施工管理工作小组在施工周计划会前，向责任单位下达《违规施工作业通知单》（B）违规责任单位施工管理部门接到《违规施工作业通知单》后，可在3个工作日内对施工违规情况进行调查，并向施工管理工作小组提交施工违规情况说明、整改措施和责任方处理决定（C）违规责任单位对违规施工情况存有异议，可在施工周计划会后3个工作日内填写《违规施工作业申诉单》，由各责任单位施工管理部门审核签章后，提交施工管理工作小组（D）施工管理工作小组在收到申诉后，2个工作日内完成复查（E）施工管理工作小组将最终违规统计纳入次周的施工管理周报\n2. 周考核指标考核流程为（ABCDE）。\n    （A）施工管理工作小组牵头召开每周施工周计划会（B）公布各单位上周施工指标完成情况（C）施工单位若对周考核指标存有异议，可在施工周计划会后2个工作日内向施工管理工作小组申诉（D）施工管理工作小组收到申诉后，1个工作日内完成复查（E）施工管理工作小组在施工周计划会后3个工作日内发布施工管理周报\n3. 在施工各环节中有发生下列情形之一，后果未构成严重违规的，应认定为一般违规（ABCDE）。\n    （A）违规申报施工计划，未产生安全风险（B）未按节点时间要求申报施工计划（C）实际施工作业区域不足计划申报区域的2/3（D）擅自动用与施工作业无关的设施设备（E）造成运营列车晚点5 min以上\n4. 在施工各环节中发生以下情况之一，应可定性为重大违规（AB）。\n    （A）发生《运营事故调查处理管理规定》中规定的构成一般E类及以上事故的事件（B）经施工管理工作小组认定的重大违规事件（C）造成运营列车最大晚点15 min以上的事件（D）造成首末班车最大晚点2 min以上的事件（E）未按规定时间办理施工延长手续\n\n\n七、上海轨道交通检修施工管理规定（正线轨行区部分）\n判断题\n1. 为避免设施设备带病运行或因抢修、天气等客观因素造成原计划被动调整，而临时增加的施工计划称为抢修计划。（×）\n2. 在一周施工计划编制过程中需优先确保安排的施工，以及各类动车施工，由计划审批单位根据施工的重要性进行统筹安排，并在周计划会上明确。（√）\n3. 入轨站是指正线轨行区的人工施工时，施工实施时进入轨行区的车站。（√）\n4. 出轨站是指正线轨行区的人工施工时，施工结束时出清轨行区的车站。（√）\n5. 正线轨行区施工计划的审批属于运管中心的主要职责。（×）\n6. 负责正线轨行区施工触网及变电站的停送电操作是运管中心的主要职责之一。（√）\n7. 负责正线轨行区施工计划的统筹、协调、平衡工作是维保公司的主要职责之一。（√）\n8. 根据影响和重要程度划分，正线轨行区施工可分为：临时施工、一级重大施工、二级重大施工、日常检修施工。（×）\n9. 造成部分运营线路中断或车站停用的施工属一级重大施工。（√）\n10. 施工周计划是指计划申报单位在每周二至周四申报的本周六至下周五的施工计划。（√）\n11. 正线轨行区域只包括正线上下行[地面段线路两侧至隔离护栏]、折返线、存车线、渡线。（×）\n12. 施工登记、注销点应在施工作业区段内的OCC车站，也可以是施工作业区域外的车站作为登记、注销点。（×）\n13. 动车施工与人工施工在同一线路同时作业时，人工施工与动车施工的安全防护距离应不小于1站或者1区间。（×）\n14. 多点作业施工只能在主站办理登记、注销，不得办理异地注销。（√\n15. 涉及110kV及以上主变电站停役超过24 h、变电设备拼柜、变压器及整流柜更换的施工属一级重大施工。（×）\n16. 新增轨道、信号、供电等运营设备/系统或接入既有运营设备/系统的施工属二级重大施工。（√）\n17. 除抢修施工、一级重大施工、二级重大施工外，其余施工均为普通施工。（×）\n18. 与行车安全防护措施、施工审批规定有突破的施工，需经运营管理部审批同意，并在计划申报时同步提交审批材料。（√）\n19. 道岔擦拭及清扫道床作业需办理施工计划申报。（×）\n20. 由于抢修等客观原因造成计划变更的，可在接到变更通知后的3个工作日内申报。（×）\n21. 台风、暴雨、高温等恶劣天气前的相关运营设备状态检查允许申请临时计划。（√）\n22. 临时计划须在施工当日21:00前向维保公司调度指挥室申报。（×）\n23. 临时发生的设备故障，OCC调度员已发布抢修令，需运营结束后安排检修的施工可以在20:00后申报。（√）\n24. 运营期间，影响出入场作业的施工，不安排在运营高峰时段和运营列车计划出入场时段。（√）\n25. 多车场线路，同一时间段可以同时安排多个影响出入场作业的施工。（×）\n26. 非运营期间，施工最早开始时间应在所有列车出清施工作业区段、停电区段和安全防护区段后，最晚结束时间应在运营开始前20 min。（×）\n27. 本线路动车的转场作业、末班车跟跑作业可选择施工作业区域外的DCC作为登记、注销点。（√）\n28. 信号调试类动车施工、专项演练类动车施工，可选择OCC作为登记、注销点（√）\n29. 申报涉及接触网/轨停电的施工时，施工作业区域一端允许有“外”。（×）\n30. 不少于2列动车在同一线路同时作业时，相邻动车施工的安全防护距离应不小于2站1区间或1站2区间。（√）\n31. 需触网供电的动车施工与接触网停电施工在同一侧线路同时作业时，动车施工所在的触网供电区段与接触网停电区段的安全防护距离应不小于1个带电的触网供电区段。（√）\n32. 接触轨线路的电客车开行区域及作业区域应申请接触轨送电。（√）\n33. 施工过程中存在距离接触网小于1 m或可能存在小于1 m时，应申请接触网停电，并注明停电范围、是否挂设接地线。（√）\n34. 计划申报单位在申报出入场线区域的停电类施工时，绝缘分段位于入场信号机相同位置或车场侧的，停电范围应包含正线及车场。（×）\n35. 涉及信号集中站的集中式UPS检修施工，可安排在动车作业日实施。（×）\n36. 会导致信号、联锁、闭塞失效的施工与动车施工不得同时安排。（√）\n37. 牵引动力为电客车的动车施工与牵引站直流开关联跳功能测试及两个连续牵引站的整流机组停电施工不得同时安排。（√）\n38. 会导致公务电话及调度热线均中断的施工与其他施工不得同时安排。（√）\n39. 涉及中央ATS软件倒换、升级施工与其他动车施工不得同时安排。（√）\n40. 主变电站在支援供电的运行方式下，相关环网站允许安排400 V及以上停电类作业及SCADA调试作业。（×）\n41. 动车施工组织的过程中，OCC调度员应对施工负责人进行施工作业区域内道岔位置、锁闭方式等进路准备情况的交底。（√）\n42. 登记点、注销点值班员在办理登记、注销作业前应验证施工负责人身份，证件与本人不符，应告知OCC调度员后，方可办理施工登记、注销。（×）\n43. 施工登记时，施工负责人应告知车站值班员施工下区间人数等信息。（√）\n44. 施工注销时，施工负责人确认已具备施工注销条件，只需要向注销站值班员提出施工注销申请，不用讲明施工结果。（×）\n45. 多点作业中，作业点的入轨站和出轨站只能是同一个车站。（×）\n     \n单择题\n1. 根据影响和重要程度划分，正线轨行区施工可分为以下4类：抢修施工、一级重大施工、二级重大施工、（B）。\n   （A）特级重大施工（B）日常检修施工（C）三级重大施工（D）临时施工\n2. （D）是指发生或预判将发生危及正线行车安全的设施设备故障，导致运营秩序紊乱或大幅降低运营服务水平时，需立即进行故障抢修的施工。\n   （A）一级重大施工（B）日常检修施工（C）二级重大施工（D）抢修施工\n3. 单个施工计划中包含2至（D）个入轨站或出轨站，且同时办理入轨登记的施工作业称为多点作业施工。\n   （A）8（B）7（C）6（D）5\n4. （B）负责一级重大施工、二级重大施工运营配套方案的制定和行车风险的评估、认定。\n   （A）运营设施设备管理部（B）运营管理部（C）OCC（D）运营公司\n5. 新车执行末班车跟跑计划前，需经（D）审批同意，并在计划申报时同步提交审批材料。\n   （A）运营设施设备管理部（B）运营公司（C）OCC（D）运营管理部\n6. 需突破行车安全防护措施、施工审批规定的施工，需经（C）审批同意，并在计划申报时同步提交审批材料。\n   （A）运营设施设备管理部（B）运营公司（C）运营管理部（D）OCC\n7. 正常情况下，每周（B）9:00至12:00，施工管理工作小组召集计划申报单位召开周计划会，讨论确定下周的核心计划。\n   （A）一（B）二（C）三（D）四\n8. 由于抢修等客观原因造成计划变更的，可在接到变更通知后的（B）个工作日内申报。\n   （A）1（B）2（C）3（D）5\n9. 临时计划须在施工当日（D）前向维保公司调度指挥室申报。\n   （A）17:00（B）18:00（C）19:00（D）20:00\n10. 1号线、2号线、5号线、7号线的人工作业日安排在每周（A）。\n   （A）一、四（B）二、五（C）三、六（D）四、日\n11. 3号线、4号线、10号线、11号线、12号线的人工作业日安排在每周（B）。\n   （A）一、四（B）二、五（C）三、六（D）四、日\n12. 6号线、8号线、9号线、13号线的人工作业日安排在每周（C）。\n   （A）一、四（B）二、五（C）三、六（D）四、日\n13. 16号线的人工作业日安排在每周（D）。\n   （A）一、四（B）二、五（C）三、六（D）四、日\n14. 施工计划的施工时间不得超出当日4:30至次日4:29，除（B）施工和集团指定的特殊施工外，不安排跨日施工。\n   （A）动车（B）变电站（C）人工作业（D）接触网停电\n15. 包含施工作业区域端头站站后岔区的施工，应扩大（A）申报\n   （A）1个区间（B）1个车站（C）1个集中区域（D）1个供电区段\n16. 高架、地面或地下线路中，若相邻线路间无永久性隔离设施，且人工施工作业面距离邻线动车线路中心线小于（A），则动车施工区域邻线不安排人工施工。\n   （A）4 m（B）5m（C）6m（D）10m\n17. 接触轨线路，车场管辖范围内，入场信号机至接触轨末端的接触轨停送电施工，纳入（B）施工。\n   （A）车场轨行区（B）正线轨行区（C）供电维修区（D）设备维修区\n18. 动车施工与人工施工在同一线路同时作业时，人工施工与动车施工的安全防护距离应不小于（C）。\n   （A）2站1区间（B）1站2区间（C）1站1区间（D）1站\n19. 施工过程中存在距离接触网小于（B）或可能存在小于（B）时，应申请接触网停电，并注明停电范围、是否挂设接地线。\n   （A）0.5m（B）1 m（C）1.5m（D）2m\n20. 工程车编组顶部距离接触网小于（D）时，应申请接触网停电。\n   （A）15cm（B）20cm（C）25cm（D）30cm\n21. 除（B）的特殊施工外，单项施工计划不得含有不同类型、跨专业的施工内容\n   （A）运管中心（B）集团指定（C）维保中心（D）运营公司\n22. 集中式UPS施工分为（B）类。\n   （A）2（B）3（C）4（D）5\n23. 施工中，如需用风、用电、用水，计划申报单位应在施工申请单中明确。如用电量超（D）kW，应向线路所属运营公司单独申请或自备发电机。\n   （A）2（B）3（C）4（D）5\n24. 涉及部分信号集中站区域的轨旁软件调试、升级的施工与其他动车施工隔开（D）。\n   （A）1站1区间（B）2站1区间（C）1站2区间（D）1个信号集中站区域。\n25. 因计划申报单位自身原因需办理计划变更时，由计划申报单位向（A）提出变更申请。\n   （A）维保公司调度指挥室（B）运管中心总调所（C）OCC（D）运营公司\n26. 除变更施工负责人外的计划变更后，维保公司调度指挥室应对（C）进行变更交底。\n   （A）运营公司（B）运管中心总调所（C）OCC值班调度长（D）专业公司调度\n27. 每日（D）由维保公司调度指挥室召集运管中心各OCC召开日计划交底电话会，对次日施工计划进行交底。\n   （A）12:00（B）13:00（C）14:00（D）15:00\n28. 每日（B），维保公司调度指挥室值班调度向各线路OCC值班调度长开展当日待执行计划的交底工作\n   （A）20:00（B）21:00（C）21:30（D）22:00\n29. 施工登记时，施工负责人应携带经审批通过的施工计划单及有效身份证件，在施工的计划开始时间前（B）min抵达登记站。\n   （A）10（B）15（C）20（D）30\n30. 施工负责人预计无法在计划结束时间内办理施工注销，应在计划结束时间前（C）min与OCC调度员联系，说明原因，得到批准后方可延长施工时间。\n   （A）10（B）15（C）20（D）30\n31. 动车施工距发车点前（D）h时，维保车辆部门应提供车况良好的计划用车，由DCC根据出车计划将施工车辆调至相应的发车股道。\n   （A）0.5（B）1（C）1.5（D）2\n32. 动车施工距发车点前（C）h时，由车场DCC设备值班员牵头施工负责人或其指定人员对施工人员和配合人员进行施工交底、安全交底、动车组织方案表交底。\n   （A）0.5（B）1（C）1.5（D）2\n33. 动车施工距发车点前（A）h时，司机应完成对动车车况及无线通讯状态的检查，确认符合行车要求，并保持处于随发状态。\n   （A）0.5（B）1（C）1.5（D）2\n34. 动车施工距发车点前（B）min时，施工负责人应组织完成出发准备工作，并与OCC调度员确认当晚的施工计划。\n   （A）15（B）30（C）45（D）60\n35. 同时含停车场及正线轨行区的施工中，司机凭（B）及施工令号在车场及正线施工作业区域内动车。\n   （A）路票（B）调度命令（C）手信号（D）出站信号\n36. 施工车辆由发车点运行至施工登记点/施工注销点回停车点的运行，由（C）负责组织行车人员实施\n   （A）施工负责人（B）车站值班员（C）OCC调度员（D）DCC运转值班员\n37. 施工车辆应按调度命令的要求时间发车，无法按时发车，施工负责人应向OCC调度员说明情况。超过发车时间（A）min无故不动车或严重影响其他施工执行时，OCC调度员可发令取消该动车施工。\n   （A）15（B）30（C）45（D）60\n38. 动车施工作业区域的封闭/封锁时，施工车辆占用封区凭证为调度命令和施工令号，封锁/封闭区段内施工车辆的运行由（B）负责指挥。\n   （A）运转值班员（B）施工负责人或其指定人员（C）信号楼值班员（D）OCC调度员\n39. 工程车平板上搭乘施工人员期间，限速（C）km/h。\n   （A）15（B）30（C）45（D）60\n40. 人、车在区间内合并作业期间，施工车辆不得动车，如由于施工需要须动车，应在《动车施工检修作业施工组织方案表》中明确，且限速（B）km/h。\n   （A）5（B）10（C）15（D）20\n41. 凡需进入线路的施工应不少于（A）人，其中1人担任现场防护员，施工人员应穿着反光背心，并根据作业性质及作业要求使用其他安全防护用品。擦拭道岔、清扫道床作业可不设现场防护员。\n   （A）2（B）3（C）4（D）5\n42. 信号新系统/软件倒接投用前，计划申报单位应组织交底及培训，倒接后安排保驾。涉及ATS、轨旁软/硬件倒换的调试施工，应保驾至次日（C）；涉及ATS、轨旁软/硬件升级的施工，应保驾至运营结束。\n   （A）8:00（B）9:00（C）10:00（D）11:00\n\n多选题\n1. 以下（ABCDE）项属于轨行区施工中维保公司的主要职责。\n（A）负责指定检修施工计划管理部门（B）负责正线轨行区施工计划的统筹、协调、平衡工作（C）负责正线轨行区施工计划的审批（D）负责指导下属各专业单位施工计划管理和施工实施管理情况的监督、检查、分析、考核（E）负责落实本单位所辖设施设备施工前、施工中、施工后的运营限制和操作手册的管理、提交、培训工作。\n2. 以下（ABCDE）属于二级重大施工。\n（A）涉及轨旁、车载、中央信号设备升级的施工（B）新增轨道、信号、供电等运营设备/系统或接入既有运营设备/系统的施工（C）涉及通信系统线路级、中央级、网络级软硬件升级的施工（D）涉及与行车相关的新技术、新设备引入的施工（E）涉及行车设备/系统操作方式、操作限制发生变化的施工。\n3. 计划变更是指因施工组织等原因，需对已审批并正式发布的施工计划进行变更，包括（ABCDE）。\n（A）缩短施工时间（B）缩小作业区段（C）变更施工负责人（D）取消计划（E）提升安全措施或防护要求  \n4. 施工组计划员与OCC交底内容包括（ABCD）。\n（A）确认双方的施工计划数量一致（B）确认施工计划无安全冲突，可执行（C）确认重大施工、变电站施工要求和施工影响（D）确认动车施工的施工内容、动车路径、施工要求和施工影响（E）确认变电站施工影响\n5. 动车施工距发车点前30 min时，司机应完成对动车车况及无线通讯状态的检查，确认符合行车要求，并保持处于随发状态。施工负责人或其指定人员和司机应联合完成（ABCD）等条件的检查，确认其符合施工要求。\n   （A）动车编组情况（B）工器具（C）货物装载准备情况（D）通讯工具（E）接地线\n6. 施工车辆由发车点至登记点或注销点回停车点的开行，若采用自动闭塞法运行时，应具备（ABCDE）条件。\n（A）车辆车载设备功能正常（B）具备维保单位出具的安全证书（C）轨旁信号设备功能正常（D）中央ATS、车站LATS功能正常，具备监控功能调（E）车载800兆无线对讲系统功能正常 。\n7. 施工负责人在施工登记时的操作步骤包括：（ABCDE）。\n（A）向登记站值班员提出施工登记申请（B）确认施工计划作业单上的各项内容与实际施工需求一致（C）告知车站值班员施工下区间人数等信息（D）凭施工登记号开始施工（E）携带经审批通过的施工计划单及有效身份证件，在施工的计划开始时间前15 min抵达登记站\n8. 施工负责人在施工注销时的操作步骤包括：（ABCD）。\n（A）确认已具备施工注销条件（B）凭施工注销号离开（C）在施工的计划结束时间前到达注销站（D）向注销站值班员提出施工注销申请，讲明施工结果（E）不凭施工注销号就可以直接离开\n9. 以下选项中，（ABCDE）是工程车平板上搭乘施工人员的作业要求。\n（A）工程车搭乘施工人员期间，限速45 km/h（B）工程车每次启动前，司机应与安全员联系，确认具备动车条件（C）工程车运行期间，施工人员不得站立在平板车上（D）已加装安全护栏的平板车，方可搭乘施工人员（E）平板前端应设置1名安全员，负责搭乘人员的安全管理，以及与工程车司机联系\n\n\n\n八、上海轨道交通检修施工管理规定（车场部分）\n判断题\n1. 车场生产区域包括站场、各类库房、试车线、牵出线、入场信号机往车场方向的出入场线、信号楼、设备用房、办公用房及公共区域等车场生产区域。（√）\n2. 车场施工是指在车场生产区内进行的各类影响正线行车及列车出入车场的施工。（×）\n3. 车场非自管区施工可分为封锁线路施工、部分线路封锁施工、不封锁线路施工。（×）\n4. 车场内调车及上试车线属于调车/试车作业，不纳入施工范围。（√）\n5. 从计划性角度划分，车场施工分为计划性施工和临时性施工。（√）\n6. 车辆专业负责管理的车辆独立检修库房[含带接发车功能]镟轮库/线、吹扫库/线、停车库内检修线、联合检修库、调机库及其他车辆专业管辖车库的线路区及库房。（√）\n7. 维保物资和后勤分公司负责管理车场洗车库/线区域，公共区域不属于其管理范围。（×）\n8. 10#线吴中路车场[除道路、绿化等公共区域外]均作为运一公司自管区域。（√）\n9. 车场自管区域施工指自管区域物理范围内进行的不影响车场行车及场内行车安全的施工。（√）\n10. 车场非自管区域施工仅包括非自管区域物理范围内进行的施工。（×）\n11. 停车场天窗时间系指车场内图定接发车大于1h的时间间隙，分为日间天窗和夜间天窗。（√）\n12. 停车库内的停车股道涉及接触网停电的登高作业，即使两侧无固定隔离设施，也无需申请相邻两股道接触网一并停电。（×）\n13. 施工过程中，不能随时下道避让列车的施工属于封锁线路施工。（√）\n14. 车场内，因台风、暴雨、高温等恶劣天气前的相关运营设备状态检查需增加的施工属于车场临时性施工。（√）\n15. 车场内，因铁路的临时转车计划需增加的施工不属于临时性施工。（×）\n16. 车场自管区域内的施工，均由运营公司审批。（×）\n17. 车场公共区域内施工， 由维保物资和后勤分公司审批。（√）\n18. 车场非自管区域内的计划性施工，由计划申报单位报至维保调度指挥室进行审批。（√）\n19. 车场非自管区域内封锁线路施工及不封锁线路施工中，影响接发车作业的施工均应安排在天窗时段。（√）\n20. 车场内临时施工不允许跨天施工。（×）\n21. 只有车场非自管区域施工，才需要至DCC或就近DCC驻勤点进行登记、注销。（×）\n22. 停车库内同一股道两列位可分别停电，且两列位隔离开关分别设置在股道两端，不得单列位单独停电，必须申请一股道整体停电。同一股道两列位可分别停电，且其中一列位隔离开关设置在股道中间两列位分段处，可分别申请停电。（√）\n23. 车场施工中，相同区域范围内不存在“人、车、电”冲突的施工可以安排在同一时间段。（√）\n24. 车场范围内所有股道的接触网/轨停送电钥匙，均由DCC管理。（√）\n25. 库外线路区域施工，原则上必须2人以上，其中一人担任现场防护员。（√）\n26. 凡需要封锁线路的施工、为防止列车错误进入封锁区，均应设置行车防护。（√）\n     \n单选题\n1. 车场生产区域包括站场、各类库房、试车线、牵出线（B）往车场方向的出入场线、信号楼、设备用房、办公用房及公共区域等车场生产区域。\n   （A）出场信号机（B）入场信号机（C）调车信号机（D）道岔防护信号机\n2. 车场施工中，线路两侧以隔离护栏、围墙为界线，无隔离护栏、围墙的，则以轨道中心线两侧（A）米为界。 \n   （A）3（B）4（C）5（D）2\n3. 车场非自管区域施工中，除封锁线路施工外，其余均为不封锁线路施工。应满足不影响正线或接发车，且无需固定占用特定线路区域，或“可以（B）分钟内下线路避让，且施工设施设备不影响行车安全”。\n   （A）5（B）10（C）15（D）20\n4. 以下不属于车场临时性施工的是（D）\n   （A）列车内外部清洁（B）铁路的临时转车计划（C）重大施工实施过程中的消缺项（D）列车架大修\n5. 车场洗车库内机洗洗车作业按照（B）施工办理。\n   （A）自管区域（B）非自管区域（C）重大（D）抢修\n6. 车场非自管区域内的计划性施工，由计划申报单位报至（C）进行审批。\n   （A）运营公司（B）车辆分公司（C）维保调度指挥室（D）物资和后勤分公司\n7. 车场计划性施工，除车辆架、大修、均衡修、集团指定的特殊施工外，其余不安排跨天施工，跨天施工不得大于（C）天。\n   （A）3（B）5（C）7（D）9\n8. 以下不属于车场施工变更项的是（B）。\n   （A）取消计划   （B）扩大施工时间（C）取消封锁（D）缩短施工时间\n9. 车场施工计划如需变更或取消，施工负责人项的变更最晚在施工开始前1h提出申请，其他项的变更应在施工未开始前（C）h提出申请。\n   （A）2（B）3（C）4（D）5\n10. 车场施工，施工负责人应在施工的计划开始时间前（A）min抵达DCC/驻勤点办理施工登记。\n   （A）15（B）10（C）5（D）20\n11. 车场施工过程中，如需延长施工时间，施工负责人需提前（D）min向DCC设备值班员申请。\n   （A）5（B）10（C）15（D）20\n12. 操作隔离开关使用的绝缘靴、绝缘手套和绝缘工具，要存放在阴凉干燥的处所妥善保管，需每（B）个月一次送质检部门进行绝缘性能的检查试验。\n   （A）3（B）6（C）7（D）12\n13. 从事隔离开关倒闸作业的人员，必须是经（C）培训、通过安全操作考试的持证人员，隔离开关操作人员、监护人员必须持证上岗。\n（A）运营公司（B）供电分公司（C）培训中心（D）运管中心\n\n多选题\n1. 车场二级重大施工主要包括：（ABCDE）。\n（A）行车设备[线路]部分停用或新增（B）信号设备[系统]大中修项目、软件升级（C）供电设备[系统]大中修项目（D）轨道设备[系统]大中修项目（E）信号设备（系统）软件升级\n2. 以下哪（ABCDE）项属于各单位使用隔离开关必须遵守的规定。\n（A）操作隔离开关人员，必须按要求进行登记，办理倒闸作业手续，严禁简化程序作业  （B）操作隔离开关必须执行呼唤应答制度，一人操作，一人监护 （C）操作隔离开关要准确、迅速，操作过程中，人体各部不得与支柱及其构件接触  （D）禁止带负荷操作隔离开关。雷电天气时，库外严禁操作隔离开关 （E）操作隔离开关使用的绝缘靴、绝缘手套和绝缘工具，要定期检测\n3. 车场施工登记中，施工负责人的操作步序是（ABCDE）。\n（A）携带有效身份证件，在施工的计划开始时间前15 min抵达登记站。涉及动火作业，应携带动火单（B）向DCC设备值班员提出施工登记申请。设置DCC驻勤点的，可通过DCC驻勤点值班员向DCC设备值班员提出申请（C）通过DCC复示大屏，确认施工计划作业单上的各项内容与实际施工需求一致，告知DCC设备值班员施工人数等信息（D）需进行调车后方可实施的施工，按调车流程办理调车作业（E）涉及停送电作业，通知停送电作业人员至DCC/DCC驻勤点进行停电作业及出借/归还钥匙登记；凭施工登记号开始施工\n4. 车场施工注销中，施工负责人的操作步序是（ABCDE）。\n（A）在施工的计划结束时间前到达DCC/DCC驻勤点（B）确认已具备施工注销条件（C）涉及停送电作业，通知停送电作业人员进行送电作业及出借/归还钥匙登记（D）向DCC设备值班员提出施工注销申请，讲明施工结果。设置DCC驻勤点的，可通过DCC驻勤点值班员向DCC设备值班员提出申请（E）凭施工注销号离开\n\n\n\n九、上海轨道交通检修施工管理规定（车站部分）\n判断题\n1. 车站施工不包括在正线轨行区车站端头门外延伸通道的巡视类施工。（×）\n2. 车站施工是指在车站区域、站外用房进行的可能影响正线行车的施工。（×）\n3. 车站施工计划如涉及客运服务设施停用12小时以上的需报备运管中心[客运服务部]。（×）\n4. 车站生产区域包括各类库房、站厅、端头门以内的站台、设备用房、生产管理用房、办公区域、换乘通道、换乘大厅、出入口通道、出入口等管理范围，不包含控制中心和应急指挥中心[含备用]。（×）\n5. 临时接报的车站设施设备故障修，可直接至车控室办理施工登记。（√）\n6. 在车站综合弱电机房内开展周期性设施设备巡视、保养作业，报各自单位[生产调度室]审批；综合弱电机房内开展设施设备检修作业报运营公司[生产调度室]审批。（√）\n7. 车站施工中，如需进入车站非自管区域、用房内施工，则需将施工计划流转相应区域管理单位，确认同意配合后，报维保公司审批。（×）\n8. 审批车站重大施工和日常检修施工时，按照谁先申报谁优先的原则，不应区别对待。（×）\n9. 车站施工中，如需用风、用电、用水，计划申报单位应在施工申请单中明确。（√）\n10. 涉及软硬件升级的车站施工，只允许在非运营时段进行。（×）\n11. 车站计划申报时，1天的时间定义为：4:00至次日的4:00。（×）\n12. 车站施工计划如申请计划变更，只允许变更施工负责人、施工时间，其余不得变更。（√）\n13. 在车站端头门外延伸通道内进行设备巡视，实施前由施工负责人安排工作人员配合开启端头门。（×）\n14. 在进行车站施工时，应落实不侵限、不超范围；运营时段服务区内施工，设置隔离栏及警示标示。（√）\n15. 对于车站施工，无论是单日或跨天施工，在实施时均只有一次施工登记/注销，期间的进出车站，均按出入登记/注销办理。（√）\n16. 如施工负责人无法提供本人有效证件[工作证/身份证]及车站检修施工申请单，则车站值班员应要求负责人签字备案后许可该施工。（×）\n17. 单日的车站施工不得登记多点作业，跨天的车站施工允许登记多点作业。（×）\n\n单选题\n1. 施工计划均应通过（B）进行申报、流转、审批。\n   （A）调度电话（B）施工管理系统（C）协同平台（D）OA系统\n2. 换乘车站、换乘通道[大厅]的自动扶梯，正常检修需停用（C）小时以上的为车站二级重大施工。\n   （A）8（B）12（C）24（D）48\n3. （B）是其所辖车站的所有车站施工的管理主体和其所辖设施设备的车站施工的实施单位。\n   （A）车辆专业（B）运营公司（C）运管中心（D）维保中心\n4. 所有车站施工均须实施计划管理，由各（B）负责施工组织方案的内部审核，并根据所制定的计划实施。\n   （A）计划审批单位（B）计划申报单位（C）计划配合单位（D）集团\n5. 如需进入车站非自管区域、用房内施工，则需将施工计划流转相应区域管理单位，确认同意配合后，报（A）审批。\n   （A）运营公司[生产调度室]（B）维保公司（C）各自单位（D）运管中心\n6. 在车站综合弱电机房内开展周期性设施设备巡视、保养作业，报（D）审批。\n   （A）运营公司（B）维保中心（C）运管中心（D）各自单位[生产调度室]\n7. 影响OCC公共设施或改变建筑物装饰结构、功能的车站施工，需流转（D）配合同意后，报区域、用房管理单位审批。\n   （A）运营公司（B）通号公司（C）工务公司（D）物资和后勤公司\n8. 单个车站施工计划，不涉及设施设备日常巡视的时间跨度不得大于（D）天。\n   （A）1（B）3（C）5（D）7\n9. 单个车站施工计划，只涉及设施设备日常巡视的，时间跨度不得大于（D）天。\n   （A）5（B）10（C）15（D）30\n10. 车站施工计划申报单位提前（B）向审批单位申报。\n   （A）1个工作日（B）2个工作日（C）3个工作日（D）一周\n11. 车站施工计划如需变更或取消，须由（B）于施工前通知审批单位。\n   （A）施工负责人（B）计划申报单位（C）车站值班员（D）行车调度\n12. 车站施工中，施工负责人应于施工开始前（B）分钟抵达车站，并至车控室向车站值班员申请办理施工登记手续。\n   （A）10（B）15（C）30（D）60\n13. 车站施工过程中，如需延长施工时间，施工负责人须提前（B）分钟向车站值班员申请。\n   （A）10（B）20（C）30（D）60\n14. 多点作业登记/注销时，由（B）通过施工管理系统进行最终施工注销操作。\n   （A）施工负责人（B）主登记站值班员（C）各车站值班员（D）调度\n15. 车站施工中，施工结束后，由（B）负责作业现场工完场清，后至车控室办理注销手续，经车站值班员同意后，施工负责人方可离开。\n   （A）车站值班员（B）施工负责人（C）施工班组成员（D）运营调度\n16. 在进行车站施工登记时，如施工负责人无法提供本人有效证件[工作证/身份证]及检修施工申请单，则车站值班员应（B）该项施工。\n   （A）登记（B）取消（C）顺延（D）注销\n17. 计划申报时，1天的时间定义为：（C）。\n   （A）3:30至次日的3:30（B）4:00至次日的4:00\n   （C）4:30至次日的4:29（D）5:00至次日的5:00\n18. 车站施工中，（A）全面负责施工现场的实施进程、施工安全和人员安全，并确保该项施工顺利完成。\n   （A）施工负责人（B）车站值班员（C）行车调度（D）公司调度\n19. 车站施工结束后，由施工负责人负责作业现场工完场清，后至车控室办理注销手续，经（A）同意后，施工负责人方可离开。\n   （A）车站值班员（B）设备调度（C）运营调度（D）生产调度\n     \n   \n\n\n十、轨道交通安全保护区巡查管理办法[试行]\n判断题\n1. 地下车站与隧道、出入库、联络线外边线外侧五十米内，属于安全保护区范围。（√）\n2. 地面车站和高架车站以及线路轨道外边线外侧三十米内，属于安全保护区范围。（√）\n3. 建造或者拆除建筑物、构筑物不属于轨道交通安全保护区域内巡查内容。（×）\n4. 发现轨道交通安全保护区范围内进行作业而未按法规规定程序申报、技术审核和办理现场监护的，督促其办理相关手续或依法进行现场处理。（√）\n5. 负责轨道交通安全保护区的日常巡查和现场处置工作是工务监护工作部的唯一职责。（×）\n6. 建管中心应在轨道交通车站及区间土建结构完成二周后，组织项目公司及工务监护工作部对结构进行初始状态确认，并向工务监护工作部移交相关结构资料及测量成果。（√）\n7. 项目公司应对所负责线路的外业巡查工作中发现的违规项目进行告知，并将违规项目相关资料移交工务监护工作部，配合后续跟踪处理。（√）\n8. 在建线路建设期间由所属各项目公司负责巡查，发现违规作业项目视情会监护工作部或报请监护工作部处理。（√）\n9. 巡查人员须携带轨道交通安全保护区专用巡查证件，穿戴统一服装进行现场巡查和处置，不需要注意仪容和礼貌。（×）\n\n单选题\n1. 地下车站与隧道、出入库、联络线外边线外侧（B）内，属于安全保护区范围。\n   （A）100米（B）50米（C）30米（D）10米\n2. （D）负责运营线路安全保护区的外业巡查和现场处置；对已完成土建的建设线路车站及区间，经建管中心组织进行结构初始状态确认并移交结构设计资料和测量成果后，负责其安全保护区外业巡查和现场处置。\n   （A）运营公司（B）项目公司（C）建管中心（D）工务监护工作部\n3. 保护区巡查人员须携带（A），穿戴统一服装进行现场巡查和处置，注意仪容和礼貌。\n（A）轨道交通安全保护区专用巡查证件（B）工作证（C）身份证（D）出入证\n\n\n\n十一、上海轨道交通检修施工作业负责人管理规定\n判断题\n1. 作业点负责人系指同一施工项目有多个作业点同步实施，每个作业点的负责人，即为作业点负责人。（√）\n2. 施工负责人的工作要求不包含施工过程中与值班员、调度员联系施工有关事项。（×）\n3. 施工负责人管理规定明确，未按规定办理施工登记、注销手续，擅自进行施工或撤离的，将按规定追究施工责任人的责任（√）\n4. 施工注销后，无需进行施工注销后的作业点评，人员即可自行撤离。（×）\n5. 施工负责人未通过施工管理考核、离职或委外单位施工项目结束等，则施工负责人名单应从施工管理系统中删除。（√）\n6. 车站和保护区检修施工计划，在申报时，至多可选择2名施工负责人。在相同的时间，2名施工负责人不得同时登记，只登记其中的1人，施工结束后由其注销。（√）\n7. 每名施工负责人只能对应一项施工，对于允许多点作业的正线轨行区施工和车站施工，每名施工负责人在某一项施工中最多可以对应10个作业点。（×）\n8. 施工负责人需按规定办理施工登记、注销手续，如需提前撤离只需电话联系即可。（×）\n9. 具有电客列车司机上岗资质的人员，无需另考施工负责人资格证，即允许担当所有施工类别的施工负责人。（×）\n10. 施工作业的安全交底、作业交底由施工负责人负责（√）\n11. 各计划申报单位应根据考核规定，制定相关细则，对日常施工管理中表现突出的施工负责人予以奖励。（√）\n\n单选题\n1. 施工负责人负责组织、协调、（B）某一项施工实施，落实施工安全管理的人员。\n   （A）传递（B）指挥（C）申报（D）监管\n2. 施工负责人的工作要求，包括施工后确认现场工完场清，（B），具备正常开展行车、客运工作条件。\n   （A）人员全部撤离（B）安全措施撤除（C）设备全部送电（D）系统平台注销\n3. 每名施工负责人只能对应一项施工，每名施工负责人在某一项施工中最多只能对应（C）个作业点。\n   （A）1（B）3（C）5（D）10\n4. 施工负责人应每隔（A）年进行一次施工负责人资格的核证。\n   （A）3（B）4（C）5（D）6\n5. 施工负责人的管理必须坚持“（B）”的原则，确保施工和列车运行安全。\n   （A）安全第一、预防为主（B）统一管理、考核上岗（C）手续齐全、安全作业（D）相互协作、统一管理\n6. 在申报车站施工和（A）计划时，至多可选择2名施工负责人。在相同的时间，2名施工负责人不得同时登记，只登记其中的1人，施工结束后由其注销。\n   （A）保护区施工（B）车场施工（C）轨行区施工（D）变电站施工\n7. （C）负责施工负责人资格证的培训、考试、资格证发放和核证。\n   （A）维保公司（B）运管中心（C）培训中心（D）运营公司\n8. （B）负责作业点的组织、协调、指挥工作。\n   （A）施工负责人（B）作业点负责人（C）现场指挥人（D）调度指挥员\n9. 每名作业点负责人至多只能负责（A）个作业点。\n   （A）1（B）2（C）3（D）5\n10. 配合人员、配合措施未到位时，擅自进行施工的，由（D）承担管理责任。\n   （A）配合单位（B）运管中心（C）放点单位（D）施工负责人\n11. 作业点负责人和施工负责人负责施工过程安全措施的落实、检查、（D）。\n   （A）执行（B）评定（C）组织（D）签认\n\n\n\n十二、上海轨道交通施工管理系统使用管理规定\n判断题\n1. 施工管理系统基础数据包括车站名称及类型、辅助线名称及位置、施工计划开始时间、触网分段位置等涉及系统冲突校验、检测的数据信息。（√）\n2. 施工管理系统，各使用单位仅包括维保公司及其下属单位。（×）\n3. 正线轨行区类施工，放点人为OCC调度员。（√）\n4. 施工管理系统中通号分公司负责施工系统投用的审批。（×）\n5. 施工管理系统电脑终端故障，由使用单位自行维修。（√）\n6. 当施工管理系统出现全路网或某条线路或OCC无法办理施工登记、注销时，不办理多点作业登记。（√）\n7. 施工管理系统出现网络故障、系统性故障，应通过网络运营设施设备故障报修系统向维保通号报修。（√）\n\n单选题\n1. （C）负责施工管理系统投用的审批。\n   （A）维保公司（B）地铁电科（C）运管中心（D）项目公司\n2. 网络故障、系统性故障，通过网络运营设施设备故障报修系统向（B）报修。\n   （A）运管中心（B）维保通号（C）地铁电科（D）信息中心\n3. 系统故障超过（D）时，施工管理工作小组应召集各单位讨论和明确后续的计划申报、审批方式。\n   （A）6（B）8（C）12（D）24\n4. （B）在组织实施正线轨行区计划施工放点过程中，在发布施工登记令号前，应人工确认施工开始条件。\n   （A）DCC调度员（B）OCC调度员（C）COSC调度员（D）COCC调度员\n5. 施工管理系统故障期间，只办理已发布抢修令的临时计划和（A）重大施工计划的申报和审批。\n   （A）一级（B）二级（C）三级（D）四级\n6. 施工管理系统电脑终端故障，由（D）维修。\n   （A）维保通号（B）地铁电科（C）信息中心（D）使用单位自行\n\n\n\n十三、上海轨道交通接触轨线路轨行区作业安全管理规定\n判断题\n1. 接触轨区域安全区是指接触轨区域内，距离接触轨防护罩外缘或列车两侧集电靴外缘大于800 mm 范围的区域，同时包括接触轨上方的空间范围。（×）\n2. 各单位应为本单位需进入接触轨区域的人员配备相应的防护工器具，并定期检查工器具的性能。（√）\n3. 各单位应对需进入接触轨区域的人员，针对其工作内容及职责进行相关接触轨作业安全的教育培训工作，培训完毕，无需考核即可安排上岗作业。（×）\n4. 作业人员在进入接触轨区域作业前应穿戴好防护工器具，做好自身安全防护措施。（√）\n5. 任何进入车场接触轨区域的人员，应向运转值班员/DCC设备值班员提出申请，经运转值班员允许后方可进入。（√）\n6. 发生线路积水，当h≤150mm时[h为积水面距轨面高度，以积水最深处为准]，所有进入轨行区的人工作业应停电。（×）\n7. 现场作业人员在带电作业过程中，如发现作业存在安全风险，需停电时，应主动向OCC调度提出停电申请，停电完成后方可进行作业。（√）\n8. 若遇异物处于管控区，作业人员可以凭专用安全防护工具[绝缘手套、绝缘棒等]进行处置，如仍无法处置，则必须安排该供电区段的接触轨停电后，进行处置。（√）\n9. 施工人员进入接触轨区域前，施工负责人负责向所有作业人员进行安全交底，并承担安全监管责任。（√）\n\n单选题\n1. 接触轨区域安全区是指接触轨区域内，距离接触轨防护罩外缘或列车两侧集电靴外缘大于（C）范围的区域，同时包括接触轨上方的空间范围。\n   （A）500mm（B）600mm（C）700mm（D）800mm\n2. 发生线路积水，当h≤（B）时[h为积水面距轨面高度，以积水最深处为准]，所有进入轨行区的人工作业应停电。\n   （A）50mm（B）100mm（C）150mm（D）200mm\n   \n\n\n1\n\n', //文本内容
            }
        },

        //创建之前
        beforeCreate(){
            //添加到缓冲机制中
            this.$store.dispatch('pushKeepAlive', 'home-index');
        },

        //页面创建时
        created(){
            this.texts = [this.wordtext]
        },

        watch:{
            findinput(val){
                console.log("正则文本", val)
                
                this.handleMatch(val)
            }
        },

        //方法
        methods :{
            handleMatch(val){
                this.wordtext = this.texts.lastObject()
                if(val.length == 0){

                    return
                }
                //1. 创建正则表达式
                try{
                    let reg = new RegExp(val, 'g')

                    this.reg = reg

                    let results = this.wordtext.match(reg)

                    let text = this.wordtext
                    for(let index in results){
                        let string = results[index]
                        text = text.replace(string, '<mark>' + string + '</mark>')
                    }
                    this.wordtext = text
                    console.log(results[0])
                }catch(error){
                    console.log("正则创建失败")
                }      
                
            },
            //回退
            back(){
                if(this.texts.length == 1){
                    return
                }
                this.texts.pop()
                this.wordtext =  this.texts.lastObject()
            },
            //替换
            replace(){
                if(this.findinput.length > 0 && this.replaceinput.length > 0){
                    let string = this.texts.lastObject()
                    this.wordtext = string.replace(this.reg, this.replaceinput)
                    this.texts.push(this.wordtext)
                    this.findinput = '';
                    this.replaceinput = '';
                }
            }
        },
        //组件从缓冲中使用会出发
        activated(){
            console.log('home activated',);
        },
    }
</script>

//样式
<style lang="scss" scoped>
    @import '../../styles/variable';
    .container{
        height: 100%;
        width: 100%;
        display: flex;
        flex-direction: column;
    }

    mark{
        border-radius: 10px;
    }

    .textarea{
        flex:1;
        padding: 10px;
        border:none;
        background-color: $bgcolor;
        overflow: scroll;
        white-space: pre-line;
    }

    .text-operation{
        padding: 0px 10px;
        .input{
            height: 35px;
            padding-left: 15px;
            margin: 5px 0px;
            border: none;
        }

        .button{
            width: 100px;
            height: 30px;
        }

    }

</style>